#coding=utf-8
#utf-8     gbk处理中文简体繁体     gb2312 简体
###注释的代码不会被运行
###############################输入输出########################################
# print  len('a')    #‘单引号  “双引号  '''三引号   都是代表字符串
# print "adsfasdf"
#ctrl+?  代码块注释   反注释  ctrl+？
#输入
# name=input("请输入姓名：")   #input只接受数字的输入0-9
# print name
# name=raw_input("请输入姓名：")  #raw_input接受任何的输入
# print name
########################################变量####################################
#不能够数字开头   4name
#可以用是下划线 或者字母开头 ，后面可以跟数字  _a   a_1   aa
#不能是中文      姓名
#不能是系统的关键字 if for print
#不能超过255个字符
#定义变量区分大小写，见名知义
# x=2.4  #float浮点型
# y=4    #整型int
# X="asdf"  #str字符串
# X={}
# #python动态语言，变量是不需要定义类型。比如int a=1
# #一旦你对变量赋值了，它就知道变量是什么类型的
# #print type(X)  #查看变量的类型
#
# print  x,y  #，逗号在python里面是不换行打印
# print  x,'\t',y #'\t' 代表打印一个制表符tab
# print  x,'\n',y #'\n' 代表打印的时候换行
####################################算术运算######################################
#print -2 * 3 + 21 // 4 ** 2
#=一个等于号是赋值 ，把后面的值赋值给前面的变量
#==两个等于号是判断，前面的值是否等于后面的值
# != 不等于
###################################条件判断#######################################
# 如果   这个家伙   等于    王思聪
#      打印  。。。
# 否则
#      干什么事情
#单分支，
# name=raw_input("请输入你的名字:::")
# if   name  ==  '王思聪':     #:冒号代表结尾
#     print "很帅"             #代码块    跟父级别之间相差4个空格
# #双分支
# else:  #:冒号代表结尾
#     print "你是个屌丝"

#多分支
# score=raw_input("请输入你的分数：：")  #raw_input返回的都是字符串
# print type(score)
# #float()  str()
# score=int(score)#强制转换为int,  把自己转为int 再赋值给自己
# print type(score)
# if score<60:
#     print  '不及格'
# elif  score==60:
#     print "及格"
# elif  60<score<80:
#     print '良好'
# else:
#     print '优秀'
#嵌套条件
#代码块统一缩进按tab键，  统一前进shift+tab
# score=raw_input("请输入你的分数：：")  #raw_input返回的都是字符串
# score=int(score)#强制转换为int,  把自己转为int 再赋值给自己
# if 0<score<=100:
#     if score<60:
#         print  '不及格'
#     elif  score==60:
#         print "及格"
#     elif  60<score<80:
#         print '良好'
#     else:
#         print '优秀'
# else:
#     print "输错鸟"

###############################################循环#############################################
# while 1: #死循环
#     #####循环体
#     score=raw_input("请输入你的分数：：")  #raw_input返回的都是字符串
#     score=int(score)#强制转换为int,  把自己转为int 再赋值给自己
#     if 0<score<=100:
#         if score<60:
#             print  '不及格'
#         elif  score==60:
#             print "及格"
#         elif  60<score<80:
#             print '良好'
#         else:
#             print '优秀'
#     else:
#         print "输错鸟"
# i=5
# while i>1:
#     print "ok"
#     i-=1  #python里面自减写法    自加写法  i+=1   类似于  i=i-1    i=1+1
#for循环
# for   i   in range(1,10,3): #步长
#     print i#循环体
#********************************************课堂练习*********************************************************
#1.计算1到100里面的所有偶数的和，并且计算代码运行的时间多少秒？
#*************************************************************************************************************
# import time
# starttime=time.time()
# sum=0
# for  i in range(1,101):
#     if i%2==0:
#         sum=sum+i
# print sum
# print time.time()-starttime
#***********************************************************************************************************
#2.数学里面有一种数，个数的三次方+十位数的三次方+百位的三次方=本身，
#问你在100-999之间还有哪些数？
# 1.首先计算百位数
# 2.十位数
# 3.个位数
#***********************************************************************************************************
# for     num    in     range(100,1000):
#     #print num,"拆开后的数字为：",num//100,num%100//10,num%100%10
#     if (num//100)**3 + (num%100//10)**3 + (num%100%10)**3  ==num:
#         print num
#************************************写个小程序*************************************************************
# 1.写一个登陆的小程序，用户名admin和密码为888888
# 2.提示用户输入用户名和密码，接下来你要判断用户输入的是否正确
# 3.如果不正确，给他三次机会，
# 4.如果都正确，打印恭喜你，登陆成功
# for i in range(10):
#     print i
#     if i ==5:
#         break
#coding=utf-8
#登录小demo
# for i in range(3):
#     username=raw_input("请输入用户名：")
#     pwd=raw_input("请输入密码：")
#     if username=="admin" and pwd=="888888":
#         print "login success"
#         break
#     else:
#         if i!=2:
#             print "用户名或密码错误请重新登录"
#         else:
#             print "您已超过最大登录次数，不再允许登录"
#************************************************九九乘法表************************************************
#输入直角三角形的乘法表
# for  i in range(1,10):
#     for j in range(1,10):
#         if i>j-1:
#             # print i,"*",j,"=",i*j,'\t',
#             print "%d*%d=%d\t"%(i,j,i*j),
#     print ""

#格式化输出：%d代表取整型数据   %f取浮点型   %s 取字符串
# print "你的名字是%s,地址是%s,你的年纪%d,身高是%f"%('duan','shenzhen',24,170.01)
#######################################随机数#########################################################
# import  random
# print random.randint(1,99)
#***************************************练习*********************************************************
#猜数字，随机产生一个数字，
#给用户输入一个数字，并且提示他跟这个随机的数字比较是大 还是小
#直到用户猜出来为止，程序结束运行









