#---------------------------第一天课后练习-------------------------------------
#************************************************************************************* 
# 1.设计一个登录程序，假设用户名admin  密码888888
# 2.提示用户输入用户密码
# 3.检测用户输入的用户和密码是否正确
# 4.正确提示用户登录成功
# 5.如果用户名或者密码任意一个输入错误，提示用户重新输入
# 6.三次机会，程序终止
# a=0
# while a<3:
#     user=raw_input('请输入用户名：')
#     passwd=raw_input('请输入密码；')
#     if user=="admin"and passwd=="888888":
#         print '登录成功'
#         break
#     else:
#         print "请重新输入用户名和密码"
#         a=a+1 
#     
    
